app/controllers/essays_controller.rb

  def index

    # debo de dar solo los que sean del current_user
    # debera de haber otra ruta con la cual otro usuario puede ver el index de otro...
    @essays = Essay.all(:conditions => { :user_id => current_user.id})
---
SELECT * FROM `essays` WHERE (`essays`.`user_id` = -612296248)

  def hexagon_index
    # Debo de dar solo los que sean del current_user
    # debera de haber otra ruta con la cual otro usuario puede ver el index de otro...
    # recibira los params con el nombre params[:user].id
    # @essays = Essay.all(:conditions => { :user_id => 1})

    @username = params[:username]
    user = User.find_by_login(@username)
    @essays = Essay.all(:conditions => { :user_id => user.id})
---
SELECT * FROM `users` WHERE (`users`.`login` = 'wallyqs') LIMIT 1
SELECT * FROM `essays` WHERE (`essays`.`user_id` = 1)

  def show
    @essay = Essay.first(:conditions => { :title => params[:title], :user_id => current_user.id})
---
SELECT * FROM `essays` WHERE (`essays`.`title` = 'new' AND `essays`.`user_id` = 2) LIMIT 1

  def hexagon_show
    @username = params[:username]
    @user = User.find_by_login(@username)
    @essay = Essay.first(:conditions => { :title => params[:title], :user_id => @user.id})
---
SELECT * FROM `users` WHERE (`users`.`login` = 'admin') LIMIT 1
SELECT * FROM `essays` WHERE (`essays`.`title` = 'hello' AND `essays`.`user_id` = 3) LIMIT 1
SELECT * FROM `users` LIMIT 1

  def edit
    @essay = Essay.first(:conditions => { :title => params[:title], :user_id => current_user.id})
---
SELECT * FROM `essays` WHERE (`essays`.`title` = 'new' AND `essays`.`user_id` = 2) LIMIT 1

  def create
    @essay = Essay.new(params[:essay])
    @essay.user_id = current_user.id

    respond_to do |format|
      if @essay.save
---
INSERT INTO `essays` (`created_at`, `title`, `updated_at`, `is_private`, `user_id`, `pretty_title`, `content`) VALUES('2009-12-31 07:43:52', 'nuevo', '2009-12-31 07:43:52', 0, 1, NULL, 'h2. el title es en realidad el resource_name y el pretty title es lo que aparece en el header')

  def update
    @essay = Essay.find_by_title(params[:title]) if !params[:title].nil?

    respond_to do |format|
      if @essay.update_attributes(params[:essay])
---
SELECT * FROM `essays` WHERE (`essays`.`title` = 'porhacer') LIMIT 1
UPDATE `essays` SET `content` = 'nuevo', `updated_at` = '2009-09-14 04:13:56' WHERE `id` = 4