app/controllers/essays_controller.rb

SELECT * FROM `users` WHERE (LOWER(`users`.login) = 'admin') LIMIT 1
---
  def show

    user = User.find_by_login(params[:username])